gender_selection = 'Для нашего подбора, уточните ваш пол:'

uploading_photos = 'Для точного подбора стиля, загрузите фото с хорошим освещением, естественной позой, где хорошо видны лицо и верхняя часть тела. Обеспечиваем конфиденциальность данных'

confirm_photo = 'Пожалуйста, убедитесь, что на загруженном фото видно ваше лицо и верхнюю часть тела, и что вы стоите естественно'

choosing_way_of_generating = 'Как мы начнем? Мы можем создать случайный лук для вас, или вы можете сами выбрать одежду, цвет и стиль. Ваш выбор?'

in_generation = {
    'prefix': 'Пожалуйста, выберите ',
    'base_clothes': 'базовую одежду',
    'special_clothes': 'тип одежды',
    'material': 'материал',
    'color': 'цвет',
    'style': 'стиль'
}

generation = [
    "Начинаем готовить ваш образ",
    "Еще собираем ваш образ. Пожалуйста, подождите",
    "Подбираем элементы для вашего лука. Осталось немного",
    "Ваш лук почти готов! Осталось чуть-чуть",
    "Готово! Ваш стильный образ готов к просмотру!"
]

generation_variants = (
'Мы подобрали для вас несколько луков. Вы можете:\n\
✅ Выбрать лучший лук и продолжить\n\
❌ Отказаться от некрасивых вариантов\n\
🔄 Начать заново примерку\n\
✨ Примерить еще с теми же параметрам')

find_clothes = [
    "Мы ищем одежду для вашего образа. Подождите несколько секунд",
    "Ваша одежда почти готова. Осталось совсем чуть-чуть",
    "Готово! Ваша стильная одежда готова к просмотру!",
]

finded_clothes = 'Отлично! Мы нашли несколько отличных вариантов. Предлагаем вам посмотреть их в магазине более детально'

save = "Вдохновились? Поделитесь этим стильным образом с друзьями! Нажмите на 'Поделиться' и раскройте свой стиль!"

saving_look_finish = "Пожалуйста, начните генерацию нового образа или перейдите в меню"

saving_look = "Пожалуйста, нажмите кнопку Далее"

in_menu = "Наш бот — это ваш личный стильный помощник. Мы поможем вам создать неповторимые образы для любого сезона и мероприятия"

go_to_pro = 'Бесконечные комбинации и новые идеи ждут вас. Пополняйте баланс прямо сейчас или получите бесплатно. Ощутите магию стиля!'

expect = 'Дождитесь окончания примерки, пожалуйста'

save_image = 'Сохраните созданный образ в удобном месте или поделитесь с друзьями\. Участвуйте в конкурсе стильных образов, оценивайте луки других и выигрывайте 100 примерок\!'